run/3DmultiRegionDuineveldRisingBubble/baseMeshes/meshB/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //




// bubble radius mm

// domain length in x,y-direction as multiple of radius

// number of cells in circumferential direction (must be divisible by 4!)

// number of cells per bubble diameter

// cell grading in inner domain (value smaller than 1)
 //0.05


 // inner point to ensure nearly cartesian grid around origin
 // point on bubble

 // arc middle point between inner points; has to be a value between the i1-factor and (i1-factor*sqrt(3/2)) to produce curvature between 0 and circle 
  // arc middle point between points on bubble




//convertToMeters 0.001; // in mm

geometry
{
    sphere
    {
        type searchableSphere;
        centre (0 0 0);
        radius 1.0;
    }
}

vertices
(
    (0.524863881081478 -0.524863881081478 -0.524863881081478) //0
    (0.577350269189626 -0.577350269189626 -0.577350269189626)
    (0.577350269189626 0.577350269189626 -0.577350269189626)
    (0.524863881081478 0.524863881081478 -0.524863881081478) //3
    (-0.524863881081478 0.524863881081478 -0.524863881081478)
    (-0.577350269189626 0.577350269189626 -0.577350269189626)
    (-0.577350269189626 -0.577350269189626 -0.577350269189626)
    (-0.524863881081478 -0.524863881081478 -0.524863881081478)  //7
    (0.524863881081478 -0.524863881081478 0.524863881081478)
    (0.577350269189626 -0.577350269189626 0.577350269189626)
    (0.577350269189626 0.577350269189626 0.577350269189626)
    (0.524863881081478 0.524863881081478 0.524863881081478)//11
    (-0.524863881081478 0.524863881081478 0.524863881081478)
    (-0.577350269189626 0.577350269189626 0.577350269189626)
    (-0.577350269189626 -0.577350269189626 0.577350269189626)
    (-0.524863881081478 -0.524863881081478 0.524863881081478)//15
);

blocks
(
    hex (0 3 4 7 8 11 12 15) (25 25 25) simpleGrading (1 1 1)  // inner block
    hex (3 2 5 4 11 10 13 12) (10 25 25) simpleGrading (0.4 1 1) // upper part
    hex (4 5 6 7 12 13 14 15) (10 25 25) simpleGrading (0.4 1 1) // equatorial part
    hex (7 6 1 0 15 14 9 8) (10 25 25) simpleGrading (0.4 1 1) // lower part
    hex (0 1 2 3 8 9 10 11) (10 25 25) simpleGrading (0.4 1 1) // equatorial part
    hex (0 1 6 7 3 2 5 4) (10 25 25) simpleGrading (0.4 1 1) // equatorial part
    hex (8 9 10 11 15 14 13 12) (10 25 25) simpleGrading (0.4 1 1) //equatorial part
);

edges
(
    arc 2 5 (0 0.707106781186547 -0.707106781186547)
    arc 5 6 (-0.707106781186547 0 -0.707106781186547)
    arc 5 13 (-0.707106781186547 0.707106781186547 0)
    
    arc 6 1 (0 -0.707106781186547 -0.707106781186547)
    arc 6 14 (-0.707106781186547 -0.707106781186547 0)

    arc 1 2 (0.707106781186547 0 -0.707106781186547)
    arc 1 9 (0.707106781186547 -0.707106781186547 0)

    arc 2 10 (0.707106781186547 0.707106781186547 0)

    arc 10 13 ( 0 0.707106781186547 0.707106781186547)
    arc 13 14 (-0.707106781186547 0 0.707106781186547)

    arc 14 9 (0 -0.707106781186547 0.707106781186547)
    arc 9 10 (0.707106781186547 0 0.707106781186547)

    arc 3 4 (0 0.58925565098879 -0.58925565098879)
    arc 4 7 (-0.58925565098879 0 -0.58925565098879)
    arc 7 0 (0 -0.58925565098879 -0.58925565098879)
    arc 0 3 (0.58925565098879 0 -0.58925565098879)
    arc 11 12 ( 0 0.58925565098879 0.58925565098879)
    arc 12 15 (-0.58925565098879 0 0.58925565098879)
    arc 15 8 (0 -0.58925565098879 0.58925565098879)
    arc 8 11 (0.58925565098879 0 0.58925565098879)
    arc 3 11 (0.58925565098879 0.58925565098879 0)
    arc 4 12 (-0.58925565098879 0.58925565098879 0)
    arc 7 15 (-0.58925565098879 -0.58925565098879 0)
    arc 0 8  (0.58925565098879 -0.58925565098879 0)
);

faces
(
    project (1 2 10 9) sphere
    project (2 5 13 10) sphere
    project (5 6 14 13) sphere
    project (6 1 9 14) sphere
    project (1 2 5 6) sphere
    project (9 14 13 10) sphere
);

patches
(
    wall interfaceShadow
    (
        (1 2 10 9)
        (2 5 13 10)
        (5 6 14 13)
        (6 1 9 14)
	(1 2 5 6)
	(9 14 13 10)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
